In [1]:
import pandas

In [2]:
s1=pandas.Series([10,20,30])
print(s1)
print(type(s1))

0    10
1    20
2    30
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
s1=pandas.Series([10,20,30], index=['A','B','C'])
print(s1)
print(type(s1))

A    10
B    20
C    30
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
s1['A']

10

In [5]:
d={'Name':['Sumit', 'Amit', 'Suman', 'Kiran'], 'age':[30,40,33,22], 'salary':[10000,20000,44000,22000]}
df=pandas.DataFrame(d)

In [6]:
df

    Name  age  salary
0  Sumit   30   10000
1   Amit   40   20000
2  Suman   33   44000
3  Kiran   22   22000

In [7]:
data = {'one':pandas.Series([1,2,3], index=['a','b','c']), 'two':pandas.Series([10,20,30,40], index=['a','b','c','d'])}
df=pandas.DataFrame(data)
df

   one  two
a  1.0   10
b  2.0   20
c  3.0   30
d  NaN   40

In [25]:
var="D:\\Training Data\\Python\\feedback1.csv"
df=pandas.read_csv(var)

In [9]:
df

    Last Name First_Name              Rating  hours  Price
0         NaN            Gandhali  excellent   10.0   1000
1       Gadde              Kavita  excellent    2.0   2000
2         NaN             gowtham       good   30.0   3000
3      Hassan                 NaN        NaN   10.0   2000
4       Kumar             Parveen  excellent    NaN   2200
5       Gupta             Sanjeev  excellent   11.0   2233
6  ramalingam          lakshmanan    average   23.0   1232
7         NaN           Venkatesh  excellent   18.0   1899
8       Kumar                Amit  excellent   22.0   1919
9        Jain              Sudhir       good   11.0    122

In [10]:
df.dtype

Last Name               object
First_Name              object
Rating                  object
hours                  float64
Price                    int64
dtype: object

In [11]:
df[(df.Rating=='excellent')]

  Last Name First_Name              Rating  hours  Price
0       NaN            Gandhali  excellent   10.0   1000
1     Gadde              Kavita  excellent    2.0   2000
4     Kumar             Parveen  excellent    NaN   2200
5     Gupta             Sanjeev  excellent   11.0   2233
7       NaN           Venkatesh  excellent   18.0   1899
8     Kumar                Amit  excellent   22.0   1919

In [12]:
df[(df.Rating=='excellent') & (df.Price>2000)]

  Last Name First_Name              Rating  hours  Price
4     Kumar             Parveen  excellent    NaN   2200
5     Gupta             Sanjeev  excellent   11.0   2233

In [14]:
df.columns

Index(['Last Name', 'First_Name         ', 'Rating', 'hours', 'Price'], dtype='object')

In [15]:
df.columns = df.columns.str.strip()
df.columns

Index(['Last Name', 'First_Name', 'Rating', 'hours', 'Price'], dtype='object')

In [16]:
df.First_Name # here we used dot as its single word

0      Gandhali
1        Kavita
2       gowtham
3           NaN
4       Parveen
5       Sanjeev
6    lakshmanan
7     Venkatesh
8          Amit
9        Sudhir
Name: First_Name, dtype: object

In [17]:
df['Last Name'] # here we used [] as its multiple words

0           NaN
1         Gadde
2           NaN
3        Hassan
4         Kumar
5         Gupta
6    ramalingam
7           NaN
8         Kumar
9          Jain
Name: Last Name, dtype: object

In [18]:
df

    Last Name  First_Name     Rating  hours  Price
0         NaN    Gandhali  excellent   10.0   1000
1       Gadde      Kavita  excellent    2.0   2000
2         NaN     gowtham       good   30.0   3000
3      Hassan         NaN        NaN   10.0   2000
4       Kumar     Parveen  excellent    NaN   2200
5       Gupta     Sanjeev  excellent   11.0   2233
6  ramalingam  lakshmanan    average   23.0   1232
7         NaN   Venkatesh  excellent   18.0   1899
8       Kumar        Amit  excellent   22.0   1919
9        Jain      Sudhir       good   11.0    122

In [19]:
# i want to find name of person who paid max price
df_sorted = df.sort_values(by='Price', ascending=False) # this will sort in descending order of price
df_sorted.head(1).First_Name

2    gowtham
Name: First_Name, dtype: object

In [21]:
df[(df.Price==df.Price.max())].First_Name

2    gowtham
Name: First_Name, dtype: object

In [22]:
df_sorted = df.sort_values(by='Price', ascending=False) # this will sort in descending order of price
df_sorted.head(2).tail(1).First_Name

5    Sanjeev
Name: First_Name, dtype: object

In [23]:
df

    Last Name  First_Name     Rating  hours  Price
0         NaN    Gandhali  excellent   10.0   1000
1       Gadde      Kavita  excellent    2.0   2000
2         NaN     gowtham       good   30.0   3000
3      Hassan         NaN        NaN   10.0   2000
4       Kumar     Parveen  excellent    NaN   2200
5       Gupta     Sanjeev  excellent   11.0   2233
6  ramalingam  lakshmanan    average   23.0   1232
7         NaN   Venkatesh  excellent   18.0   1899
8       Kumar        Amit  excellent   22.0   1919
9        Jain      Sudhir       good   11.0    122

In [24]:
df.tail(1)

  Last Name First_Name Rating  hours  Price
9      Jain     Sudhir   good   11.0    122

In [26]:
df

    Last Name First_Name              Rating  hours  Price
0         NaN            Gandhali  excellent   10.0   1000
1       Gadde              Kavita  excellent    2.0   2000
2         NaN             gowtham       good   30.0   3000
3      Hassan                 NaN        NaN   10.0   2000
4       Kumar             Parveen  excellent    NaN   2200
5       Gupta             Sanjeev  excellent   11.0   2233
6  ramalingam          lakshmanan    average   23.0   1232
7         NaN           Venkatesh  excellent   18.0   1899
8       Kumar                Amit  excellent   22.0   1919
9        Jain              Sudhir       good   11.0    122

In [27]:
# drop a column from df
new_df = df.drop('Rating', axis=1) # it will return new_df which will not have Rating/ axis = 1 means column wise
new_df

    Last Name First_Name           hours  Price
0         NaN            Gandhali   10.0   1000
1       Gadde              Kavita    2.0   2000
2         NaN             gowtham   30.0   3000
3      Hassan                 NaN   10.0   2000
4       Kumar             Parveen    NaN   2200
5       Gupta             Sanjeev   11.0   2233
6  ramalingam          lakshmanan   23.0   1232
7         NaN           Venkatesh   18.0   1899
8       Kumar                Amit   22.0   1919
9        Jain              Sudhir   11.0    122

In [ ]:
df.drop('Rating', axis=1, inplace=True) # it will drop the column Rating from original data frame, it will not return
df